RoRtutorial_practice/app/controllers/articles_controller.rb

INSERT INTO "articles" ("created_at", "text", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-12-10 17:53:29.165301"], ["text", "a"], ["title", "a"], ["updated_at", "2014-12-10 17:53:29.165301"]]
---
    def create
        #Directly show params(title and text)
        #render plain: params[:article].inspect

        #get params and save to object @article,
        #transmit @article to views page and handle @article
        @article = Article.new(article_params)

        if @article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "articles" SET "text" = $1, "title" = $2, "updated_at" = $3 WHERE "articles"."id" = 2  [["text", "bbbbbb"], ["title", "bbbbbbb"], ["updated_at", "2014-12-10 22:55:53.481174"]]
---
    def update
        @article = Article.find(params[:id])
        if @article.update(article_params)