RoRtutorial_practice/app/controllers/comments_controller.rb

  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(comment_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", 2]]
INSERT INTO "comments" ("article_id", "body", "commenter", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["article_id", 2], ["body", "fuckyou"], ["commenter", "mincong"], ["created_at", "2014-12-11 19:12:41.483913"], ["updated_at", "2014-12-11 19:12:41.483913"]]